import { postInterface, researchesInterface, resercherInterface } from "./interface";

export const researches:researchesInterface[] = [
    {
        "researchTitle": "High Performance 지식 표현",
        "date": "2020. 07 ~ 2027. 12"
    },
    {
        "researchTitle": "(3세부과제) 스마트 에듀팜 활용을 위한 IoT 교육프로 그램 개발",
        "date": "2021. 04 ~ 2022. 09"
    },
    {
        "researchTitle": "CNN 기반의 가짜뉴스 탐지",
        "date": "2022. 02 ~ 2023. 03"
    },
    {
        "researchTitle": "최신 산업 분야 투자 및 지원을 위한 메타버스 기술 및 시장에 관한 연구",
        "date": "2022. 08 ~ 2022. 09"
    },
    {
        "researchTitle": "양자컴퓨터 SW알고리즘 기초 연구 및 양자SW 전문 인재양성 육성 연구 및 지식 습득",
        "date": "2022. 09 ~ 2022. 12"
    }
];

export const researchers:resercherInterface[] = [
    {
        "name": "박지혁",
        "role": "4학년 / 캡트톤 디자인 참여",
        "bio": "화이팅",
        "interasted": "웹 / DevOps"
    },
    {
        "name": "염휘건",
        "role": "4학년 / 캡트톤 디자인 참여",
        "interasted": "웹 / 앱",
        "bio": "안녕하세요"
    },
    {
        "name": "이강일",
        "role": "4학년 / 캡트톤 디자인 참여",
        "interasted": "DevOps / 서버 / 데이터"
    },
    {
        "name": "유용찬",
        "role": "4학년 / 캡트톤 디자인 참여",
        "interasted": "웹 / 앱 / 게임",
        "bio": "게임개발자(기획자)를 목표로 공부중인 Java를 주력으로 하는 예비 개발자"
    },
    {
        "name": "정기태",
        "role": "4학년 / 캡트톤 디자인 참여"
    },
    {
        "name": "유현빈",
        "role": "4학년 / 캡트톤 디자인 참여"
    },
    {
        "name": "한재성",
        "role": "4학년 / 캡트톤 디자인 참여",
        "interasted": "웹 / 게임"
    },
    {
        "name": "추승우",
        "role": "4학년 / 캡트톤 디자인 참여"
    },
    {
        "name": "성민우",
        "interasted": "웹 / 보안 / 서버",
        "role": "3학년 / 연구실장",
        "bio": "코이의 법칙"
    },
    {
        "name": "이기성",
        "role": "3학년 / 부연구실장",
        "bio": "👍👍🏻👍🏼👍🏽👍🏾👍🏿 굿굿굿굿굿굿!",
        "interasted": "창업 / 기획 / 건축"
    },
    {
        "name": "송인섭",
        "role": "3학년",
        "interasted": "보안 / 인공지능 / 데이터",
        "bio": "안녕하세요. 저는 창업을 하고싶은 컴퓨터공학과 송인섭입니다."
    },
    {
        "name": "김규륭",
        "role": "3학년 / 휴학"
    },
    {
        "name": "강민경",
        "role": "3학년",
        "interasted": "웹 / 보안 / 데이터"
    },
    {
        "name": "안효선",
        "role": "3학년",
        "interasted": "웹 / 앱 / 데이터 / 게임"
    },
    {
        "name": "윤시훈",
        "role": "2학년"
    },
    {
        "name": "장나정",
        "role": "2학년 / 휴학"
    },
    {
        "name": "이승준",
        "role": "2학년",
        "interasted": "게임"
    },
    {
        "name": "양수회",
        "role": "2학년 / ",
        "interasted": "앱 / 웹 서버",
        "bio": "👍👍"
    },
    {
        "name": "최민서",
        "role": "1학년",
        "bio": "깍두기 / 랩장 희망자"
    },
    {
        "name": "김유나",
        "role": "1학년",
        "interasted": "인공지능"
    },
    {
        "name": "신민주",
        "role": "1학년",
        "interasted": "서버",
        "bio": "."
    },
    {
        "name": "이수현",
        "role": "1학년",
        "bio": "병아리"
    },
    {
        "name": "김윤아",
        "role": "1학년",
        "interasted": "서버 / 인공지능 / 데이터",
        "bio": "열심히 노력하는 연구원이 되도록 하겠습니다."
    },
    {
        "name": "이현정",
        "role": "1학년",
        "bio": "여러 분야에 관심이 많고, 열정도 많은 연구원 입니다 🙂",
        "interasted": "웹 / 앱 / 임베디드 / 보안 / 서버 / 인공지능 / 데이터 / 게임"
    },
    {
        "name": "김준영",
        "role": "1학년",
        "interasted": "서버 / 데이터",
        "bio": "다양한 지식들을 통해서 연구원들에게 도움이 될 수 있는 사람."
    },
    {
        "name": "이창록",
        "role": "1학년",
        "interasted": "게임",
        "bio": "짝수반 1학년 이창록입니다."
    },
    {
        "name": "김성현",
        "role": "1학년",
        "interasted": "앱"
    },
    {
        "name": "조현우",
        "role": "1학년"
    },
    {
        "name": "오현준",
        "role": "1학년",
        "interasted": "웹 / 보안",
        "bio": "안녕하세요 오현준입니다"
    }
];

export const posts: postInterface[] = [
    {
        title: '여러분을 지원하겠습니다.',
        description: '고사양 서버 PC들을 통해 여러분의 연구에서 필요한 자원 또는 가상 환경을 제공하며, 연구실 지원 비용을 통해 간단한 다과 및 커피등 연구원들에 대한 편의를 제공합니다.',
        img: {
            url: "https://images.unsplash.com/photo-1550745165-9bc0b252726f?q=80&w=2940&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
        }
    },
    {
        title: '당신의 길잡이',
        description:
            '교수님간 상담 외 연구원간 대화를 통해 자신의 진로를 명확히 찾아 나아가는 활동을 하며 꿈이 맞는 연구원과 서로 응원해주며 앞으로 나아가는 연구실입니다.',
        img: {
            url: "https://images.unsplash.com/photo-1432888498266-38ffec3eaf0a?q=80&w=2948&auto=format&fit=crop&ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D",
        }
    },
    {
        title: '함께 성장합니다.',
        description:
            '연구실 내 네트워킹을 통해 자료 및 정보를 공유하며 함께 성장합니다. 또한 연구실 내 프로젝트를 기획하고 운영하며 연구실 내 노하우를 공유하며 또 한번 성장합니다.',
        img: {
            url: "/Study.jpg",
        }
    },
];